Tekla.Structures.Plugins.DirectManipulation.Core.IToolbar
The Tekla.Structures.Plugins.DirectManipulation.Core.IToolbar interfaces the toolbar creation service.

Tekla.Structures.Plugins.DirectManipulation.Core.IToolbar.CreateButton(System.String,System.Drawing.Image)
Creates button control.
text: The text.
image: The image.
Returns: The button control.

Tekla.Structures.Plugins.DirectManipulation.Core.IToolbar.CreateCheckBox(System.String,System.Drawing.Image)
Creates check box control.
text: The text.
image: The image.
Returns: The check box control.

Tekla.Structures.Plugins.DirectManipulation.Core.IToolbar.CreateDropDown
Creates drop down control.
Returns: The drop down list control.

Tekla.Structures.Plugins.DirectManipulation.Core.IToolbar.CreateDropDown(System.Collections.Generic.IEnumerable{System.Object})
Creates the drop down.
items: The items.
Returns: The drop down list control.

Tekla.Structures.Plugins.DirectManipulation.Core.IToolbar.CreateDropDown(System.Collections.Generic.IEnumerable{System.Object},System.Object)
Creates the drop down.
items: The items.
selectedItem: The selected item.
Returns: The drop down list control.

Tekla.Structures.Plugins.DirectManipulation.Core.IToolbar.CreateRadioButton(System.String,System.Drawing.Image,System.String)
Creates radio button control.
text: The text.
image: The image.
group: The group.
Returns: The radio button control.

Tekla.Structures.Plugins.DirectManipulation.Core.IToolbar.CreateTextBox(System.String,System.Drawing.Image)
Creates text box control.
text: The text.
image: The image.
Returns: The text box control.

Tekla.Structures.Plugins.DirectManipulation.Core.IToolbar.CreateValueTextBox(System.Nullable{System.Double})
Creates value text box control.
value: The value.
Returns: The value text box control.

Tekla.Structures.Plugins.DirectManipulation.Core.IToolbar.CreateDistanceValueTextBox(System.Nullable{System.Double})
Creates distance value text box control.
value: The value.
Returns: The distance value text box control.

Tekla.Structures.Plugins.DirectManipulation.Core.IToolbar.CreateAngleValueTextBox(System.Nullable{System.Double})
Creates angle value text box control.
value: The value.
Returns: The angle value text box control.

Tekla.Structures.Plugins.DirectManipulation.Core.IToolbar.CreateLabel(System.String,System.Drawing.Image)
Creates the label control.
text: The text.
image: The image.
Returns: The label control.

Tekla.Structures.Plugins.DirectManipulation.Core.IToolbar.Remove(Tekla.Structures.Plugins.DirectManipulation.Core.ControlBase)
Removes the specified control.
control: The control.